
Процедура КнопкаВыполнитьНажатие(Кнопка)
	// Вставить содержимое обработчика.
	
	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбора.Заголовок = "Выберите каталог";
	
	Если ДиалогВыбора.Выбрать() Тогда
		ИмяФайла = ДиалогВыбора.ПолноеИмяФайла;
	КонецЕсли;
	
	//очищаем таблицу и удаляем информацию
	Таблица.Очистить();
	Таблица.Колонки.Очистить();
	ЭлементыФормы.Таблица.Колонки.Очистить();
	
	// чтение
	ЗагружаемыйФайл = Новый ТекстовыйДокумент;
	ЗагружаемыйФайл.Прочитать(ИмяФайла);
	
	//шапка по умолчанию первая строчка
	Шапка = ЗагружаемыйФайл.ПолучитьСтроку(1);
	Разделитель = ";";
	//раскладываем стрoку в массив
	МассивКол = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(Шапка,Разделитель); // процедура из типовой конфигурации, разбивает строку в массив по разделителям
	
	//генерируем столбцы
	Для Каждого ИмяСтолбца Из МассивКол Цикл
		
		ИмяБезПробелов = СтрЗаменить(ИмяСтолбца," ",""); // убираем из имени пробелы
		Таблица.Колонки.Добавить(ИмяБезПробелов,,ИмяСтолбца);
		НовыйСтолбец = ЭлементыФормы.Таблица.Колонки.Добавить(ИмяБезПробелов, ИмяСтолбца);
		НовыйСтолбец.Данные = ИмяБезПробелов;
		
	КонецЦикла;
	Для НомерСтолбца = 1 по 8 Цикл 
		ИмяСтолбца = "Родитель"+Строка(НомерСтолбца); 
		ИмяБезПробелов = СтрЗаменить(ИмяСтолбца," ",""); // убираем из имени пробелы
		Таблица.Колонки.Добавить(ИмяБезПробелов,,ИмяСтолбца);
		НовыйСтолбец = ЭлементыФормы.Таблица.Колонки.Добавить(ИмяБезПробелов, ИмяСтолбца);
		НовыйСтолбец.Данные = ИмяБезПробелов;

	КонецЦикла;
	//ИмяСтолбца = "Код товара для старой номенклатуры";
	//ИмяБезПробелов = СтрЗаменить(ИмяСтолбца," ",""); // убираем из имени пробелы
	//Таблица.Колонки.Добавить(ИмяБезПробелов,,ИмяСтолбца);
	//НовыйСтолбец = ЭлементыФормы.Таблица.Колонки.Добавить(ИмяБезПробелов, ИмяСтолбца);
	//НовыйСтолбец.Данные = ИмяБезПробелов;
	//
	//ИмяСтолбца = "Наименование номенклатуры в старой базе";
	//ИмяБезПробелов = СтрЗаменить(ИмяСтолбца," ",""); // убираем из имени пробелы
	//Таблица.Колонки.Добавить(ИмяБезПробелов,Новый ОписаниеТипов("СправочникСсылка.Номенклатура"),ИмяСтолбца);
	//НовыйСтолбец = ЭлементыФормы.Таблица.Колонки.Добавить(ИмяБезПробелов, ИмяСтолбца);
	//НовыйСтолбец.Данные = ИмяБезПробелов;

	//ИмяСтолбца = "Код товара для новой номенклатуры";
	//ИмяБезПробелов = СтрЗаменить(ИмяСтолбца," ",""); // убираем из имени пробелы
	//Таблица.Колонки.Добавить(ИмяБезПробелов,,ИмяСтолбца);
	//НовыйСтолбец = ЭлементыФормы.Таблица.Колонки.Добавить(ИмяБезПробелов, ИмяСтолбца);
	//НовыйСтолбец.Данные = ИмяБезПробелов;
	//
	//ИмяСтолбца = "Наименование номенклатуры в новой базе";
	//ИмяБезПробелов = СтрЗаменить(ИмяСтолбца," ",""); // убираем из имени пробелы
	//Таблица.Колонки.Добавить(ИмяБезПробелов,,ИмяСтолбца);
	//НовыйСтолбец = ЭлементыФормы.Таблица.Колонки.Добавить(ИмяБезПробелов, ИмяСтолбца);
	//НовыйСтолбец.Данные = ИмяБезПробелов;

	
	Для НомерСтроки=2 по ЗагружаемыйФайл.КоличествоСтрок() Цикл
		
		Состояние("Обрабатывается "+Строка(Формат(?(ЗагружаемыйФайл.КоличествоСтрок()=0,0,((100*НомерСтроки)/                                                                                                ЗагружаемыйФайл.КоличествоСтрок())),"ЧЦ=3; ЧДЦ=0"))+" %");
		ОбработкаПрерыванияПользователя(); //указав данный оператор, цикл можно прервать в любой момент нажатие ctrl+break
		
		// получить стрoку с указанным номером и преобразуем её в массив
		Строка = ЗагружаемыйФайл.ПолучитьСтроку(НомерСтроки);
		МассивКол = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(Строка,Разделитель);// процедура из типовой конфигурации, разбивает строку в массив по разделителям
		НоваяСтрочка= Таблица.Добавить();
		//
		//Если МассивКол.Количество() <> Таблица.Колонки.Количество() Тогда
		//	Продолжить; // скорее всего в тексте содержит разделитель
		//КонецЕсли;
		
		Для НомерСтолбца= 1 по МассивКол.Количество() Цикл
			////заполняем строчку значениями
			
				ТекущееЗначение = МассивКол[НомерСтолбца-1];
				ИмяКолонки = Таблица.Колонки[НомерСтолбца-1].Имя;
				НоваяСтрочка[ИмяКолонки] = ТекущееЗначение;
			
			//Если НомерСтолбца = 1 или НомерСтолбца = 3 тогда
			//	ТекущееЗначение = МассивКол[НомерСтолбца-1];
			//	ИмяКолонки = Таблица.Колонки[НомерСтолбца-1].Имя;
			//	НоваяСтрочка[ИмяКолонки] = ТекущееЗначение;
			//иначе
			//	ТекущееЗначение = МассивКол[НомерСтолбца-1];
			//	ИмяКолонки = Таблица.Колонки[НомерСтолбца-1].Имя;
			//	
			//	НоваяСтрочка[ИмяКолонки] = Справочники.Номенклатура.НайтиПоНаименованию(ТекущееЗначение);
			//КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
	
КонецПроцедуры
